
Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Вид = "ЗаполнениеОбъекта";
	МассивНазначений = Новый Массив();
	МассивНазначений.Добавить("Документ.ПоступлениеТоваровУслуг");
	ПараметрыРегистрации.Назначение =  МассивНазначений;
	ПараметрыРегистрации.Наименование = "Заполнить аналитику по умолчанию";
	ПараметрыРегистрации.Версия= "1.0";
	ПараметрыРегистрации.Информация	= "Заполнить аналитику по умолчанию";
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	
	НоваяКоманда.Представление =  "Заполнить аналитику по умолчанию";
	НоваяКоманда.Идентификатор =  "ЗаполнитьАналитикуПоУмолчанию";
	НоваяКоманда.Использование =  "ОткрытиеФормы"; // "ВызовКлиентскогоМетода";

	Возврат ПараметрыРегистрации;

КонецФункции

